app/controllers/admin/allowed_sources_controller.rb

SELECT `allowed_sources`.* FROM `allowed_sources`   ORDER BY `allowed_sources`.`octet1` ASC, `allowed_sources`.`octet2` ASC, `allowed_sources`.`octet3` ASC, `allowed_sources`.`octet4` ASC
---
  def index
    @allowed_sources = AllowedSource.order(:octet1, :octet2, :octet3, :octet4)

INSERT INTO `allowed_sources` (`created_at`, `namespace`, `octet1`, `octet2`, `octet3`, `octet4`, `updated_at`, `wildcard`) VALUES ('2014-08-28 10:08:02', 'staff', 192, 168, 2, 0, '2014-08-28 10:08:02', 1)
SELECT `allowed_sources`.* FROM `allowed_sources`   ORDER BY `allowed_sources`.`octet1` ASC, `allowed_sources`.`octet2` ASC, `allowed_sources`.`octet3` ASC, `allowed_sources`.`octet4` ASC
---
  def create
    @new_allowed_source = AllowedSource.new(allowed_source_params)
    @new_allowed_source.namespace = 'staff'
    if @new_allowed_source.save
      flash.notice = '許可IPアドレスを追加しました。'
      redirect_to action: 'index'
    else
      @allowed_sources = AllowedSource.order(:octet1, :octet2, :octet3, :octet4)