app/controllers/admin/sessions_controller.rb

SELECT  `admin_members`.* FROM `admin_members`  WHERE `admin_members`.`email_for_index` = 'shoichi.shimizu@me.com' LIMIT 1
---
  def create
    @form =Admin::LoginForm.new(params[:admin_login_form])
    if @form.email.present?
      admin_member = AdminMember.find_by(email_for_index: @form.email.downcase)