app/controllers/admin/staff_members_controller.rb

  def index
    @staff_members = StaffMember.order(:family_name_kana, :given_name_kana)
    @staff_members = @staff_members.page(params[:page])
---
SELECT  `staff_members`.* FROM `staff_members`   ORDER BY `staff_members`.`family_name_kana` ASC, `staff_members`.`given_name_kana` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `staff_members`