app/controllers/admin/staff_members_controller.rb

  def create
    @staff_member = StaffMember.new(staff_member_params)
    if @staff_member.save
---
INSERT INTO `staff_members` (`created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `given_name`, `given_name_kana`, `hashed_password`, `start_date`, `updated_at`) VALUES ('2014-08-27 08:30:34', 'member1@example.com', 'member1@example.com', '山田', 'ヤマダ', '太郎', 'タロウ', '$2a$10$75da7oFPRHoo.QbDdBgkceYUMvrifYYcLTPaDFnUKFbym7pPZmTqS', '2014-08-26', '2014-08-27 08:30:34')

  def update
    @staff_member = StaffMember.find(params[:id])
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.save
---
SELECT  "staff_members".* FROM "staff_members"  WHERE "staff_members"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE `staff_members` SET `email` = 'member2@example.com', `email_for_index` = 'member2@example.com', `hashed_password` = '$2a$10$jw6CXB3msbGhxp/VhbeajujjZMXDk1vd9SsRMgh4ju8QiSPxu01rq', `suspended` = 1, `updated_at` = '2014-08-27 08:30:35' WHERE `staff_members`.`id` = 2