app/views/staff/programs/_entries_form.html.erb

SELECT `customers`.* FROM `customers`  WHERE `customers`.`id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
SELECT `entries`.* FROM `entries`  WHERE `entries`.`program_id` = 17  ORDER BY entries.id
---
<% entries = @program.entries.includes(:customer).order('entries.id').to_a