app/controllers/staff/accounts_controller.rb

  def update
    @staff_member = current_staff_member
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.save
---
UPDATE "staff_members" SET "email" = $1, "email_for_index" = $2, "updated_at" = $3 WHERE "staff_members"."id" = 4  [["email", "test@example.com"], ["email_for_index", "test@example.com"], ["updated_at", "2014-08-20 07:59:40.777427"]]