app/controllers/staff/customers_controller.rb

  def edit
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @customer_form = Staff::CustomerForm.new
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
INSERT INTO `customers` (`birth_mday`, `birth_month`, `birth_year`, `birthday`, `created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `gender`, `given_name`, `given_name_kana`, `hashed_password`, `updated_at`) VALUES (1, 1, 1970, '1970-01-01', '2014-08-27 08:30:38', 'test@example.jp', 'test@example.jp', '試験', 'シケン', 'female', '花子', 'ハナコ', '$2a$10$flZcsE0NxkL6.ZuiGU0RQ.frs2OqSKQgS5yazSH0208EjYTFjdHZe', '2014-08-27 08:30:38')

  def update
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "customers" SET "email" = $1, "email_for_index" = $2, "updated_at" = $3 WHERE "customers"."id" = 3  [["email", "test@example.jp"], ["email_for_index", "test@example.jp"], ["updated_at", "2014-08-20 07:59:43.731862"]]