app/controllers/staff/customers_controller.rb

  def edit
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 84 LIMIT 1