app/controllers/staff/programs_controller.rb

SELECT COUNT(*) FROM `programs`
---
  def index
    @programs = Program.listing.page(params[:page])

SELECT  `programs`.* FROM `programs`  WHERE `programs`.`id` = 18 LIMIT 1
---
  def show
    @program = Program.listing.find(params[:id])

SELECT  `programs`.* FROM `programs`  WHERE `programs`.`id` = 20 LIMIT 1
---
  def edit
    @program_form = Staff::ProgramForm.new(Program.find(params[:id]))

INSERT INTO `programs` (`application_end_time`, `application_start_time`, `created_at`, `description`, `max_number_of_participants`, `min_number_of_participants`, `registrant_id`, `title`, `updated_at`) VALUES ('2014-09-30 08:00:00', '2014-08-30 00:00:00', '2014-08-30 11:15:37', '詳細', 1, 1, 1, 'タイトル', '2014-08-30 11:15:37')
---
  def create
    @program_form = Staff::ProgramForm.new
    @program_form.assign_attributes(params[:form])
    @program_form.program.registrant = current_staff_member
    if @program_form.save

SELECT  `programs`.* FROM `programs`  WHERE `programs`.`id` = 20 LIMIT 1
UPDATE `programs` SET `max_number_of_participants` = 1, `min_number_of_participants` = 1, `updated_at` = '2014-08-30 11:15:00' WHERE `programs`.`id` = 20
---
  def update
    @program_form = Staff::ProgramForm.new(Program.find(params[:id]))
    @program_form.assign_attributes(params[:form])
    if @program_form.save

SELECT  `programs`.* FROM `programs`  WHERE `programs`.`id` = 21 LIMIT 1
DELETE FROM `programs` WHERE `programs`.`id` = 21
---
  def destroy
    program = Program.find(params[:id])
    if program.deletable?
      program.destroy!

SELECT  `programs`.* FROM `programs`  WHERE `programs`.`id` = 19 LIMIT 1
UPDATE `entries` SET `entries`.`canceled` = 1 WHERE `entries`.`program_id` = 19 AND `entries`.`id` IN (2)
---
  def entries
    entries_form = Staff::EntriesForm.new(Program.find(params[:id]))
    entries_form.assign_attributes(params[:form])
    entries_form.save